app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'owner'
 LIMIT 1
---
    public function doLogin()
    {
        $session = session();
        $model = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();