app/Controllers/ProductController.php

    public function index()
    {
        $products = $this->productModel
            ->select('products.*, suppliers.name as supplier_name, stores.name as store_name')
            ->join('suppliers', 'suppliers.id = products.supplier_id', 'left')
            ->join('stores', 'stores.id = products.store_id')
            ->findAll();
---
SELECT `products`.*, `suppliers`.`name` as `supplier_name`, `stores`.`name` as `store_name`
FROM `products`
LEFT JOIN `suppliers` ON `suppliers`.`id` = `products`.`supplier_id`
JOIN `stores` ON `stores`.`id` = `products`.`store_id`

    public function create()
    {
        $suppliers = $this->supplierModel->findAll();
        $stores    = $this->storeModel->findAll();
---
SELECT *
FROM `stores`