app/Controllers/ProductController.php

    public function index()
    {
        $productModel = new ProductModel();

        $storeId = session()->get('active_store_id');
        $products = $productModel->where('store_id', $storeId)->findAll();
---
SELECT *
FROM `products`
WHERE `store_id` = '1'

    public function store()
    {
        $productModel = new ProductModel();

        $productModel->insert([
            'store_id'   => session()->get('active_store_id'),
            'name'       => $this->request->getPost('name'),
            'buy_price'  => $this->request->getPost('buy_price'),
            'sell_price' => $this->request->getPost('sell_price'),
            'stock'      => $this->request->getPost('stock'),
        ]);
---
SELECT *
FROM `products`
WHERE `store_id` = '1'