app/Controllers/StoreSelectorController.php

SELECT *
FROM `stores`
WHERE `stores`.`id` = '2'
---
    public function setActive($id)
    {
        $storeModel = new StoreModel();
        $store = $storeModel->find($id);