app/Controllers/StoreController.php

    public function index()
    {
        // Hanya untuk role owner & admin
        if (!in_array(session()->get('role_id'), [1, 2])) {
            return redirect()->to('/dashboard')->with('error', 'Akses ditolak');
        }

        $data = [
            'title' => 'Manajemen Toko',
            'stores' => $this->storeModel->findAll()
        ];
---
SELECT *
FROM `stores`