app/Controllers/SupplierController.php

    public function index()
    {
        if ($redirect = $this->checkAccess()) return $redirect;

        $data['suppliers'] = $this->supplierModel->findAll();
---
SELECT *
FROM `suppliers`