app/Controllers/UserController.php

    public function create()
    {
        $storeModel = new \App\Models\StoreModel();
        $roleModel = new \App\Models\RoleModel();

        $rolesRaw = $roleModel->findAll();
        $roles = [];

        foreach ($rolesRaw as $r) {
            // Ubah 'name' ke kolom yang sesuai di database, misalnya 'role_name'
            $roles[$r['id']] = $r['role_name'];
        }

        $data = [
            'title' => 'Tambah User',
            'action' => site_url('user/store'),
            'stores' => $storeModel->findAll(),
            'roles'  => $roles
        ];
---
SELECT *
FROM `roles`
SELECT *
FROM `stores`

    public function edit($id)
    {
        $userModel = new UserModel();
        $storeModel = new StoreModel();
        $roleModel = new RoleModel();

        $user = $userModel->find($id);

        // Mapping roles ke bentuk [id => role_name]
        $rolesRaw = $roleModel->findAll();
        $roles = [];
        foreach ($rolesRaw as $r) {
            $roles[$r['id']] = $r['role_name'];
        }

        $data = [
            'title'  => 'Edit User',
            'user'   => $user,
            'action' => site_url('user/update/' . $id),
            'roles'  => $roles,
            'stores' => $storeModel->findAll(),
        ];
---
SELECT *
FROM `users`
WHERE `users`.`id` = '4'