app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `username` != 'owner'
---
    public function index()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->where('username !=', 'owner')->findAll();

DELETE FROM `users`
WHERE `id` IN ('4')
---
    public function delete($id)
    {
        $model = new UserModel();

        // Cegah jika yang dihapus adalah owner
        $user = $model->find($id);
        if ($user && $user['username'] === 'owner') {
            return redirect()->to('/manajemen-user')->with('error', 'Akun owner tidak boleh dihapus!');
        }

        $model->delete($id);