app/Models/UserModel.php

SELECT `users`.*, `roles`.`role_name`, `stores`.`name` AS `store_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
LEFT JOIN `stores` ON `stores`.`id` = `users`.`store_id`
WHERE `users`.`username` != 'owner'
---
    public function getUsersWithRole()
    {
        return db_connect()->table('users')
            ->select('users.*, roles.role_name, stores.name AS store_name')
            ->join('roles', 'roles.id = users.role_id')
            ->join('stores', 'stores.id = users.store_id', 'left')
            ->where('users.username !=', 'owner')
            ->get()
            ->getResult(); // GUNAKAN getResult() untuk hasil berbentuk object