app/Views/layouts/sidebar.php

SELECT *
FROM `stores`
---
    <?php if (in_array(session()->get('role_id'), [1, 2])): ?>
        <?php
            $storeModel = new \App\Models\StoreModel();
            $stores = $storeModel->findAll();